#include "main.h"

template<> sceneryi bsmeta<sceneryi>::elements[] = {{},
{Female, "лестница, ведущая вниз", "лестнице", "лестницу", "Лестница вела отсюда вниз. Ступеньки винтовой спиралью уходили на этаж ниже."},
{NoGender, "множество контейнеров разных размеров", "контейнерам", "контейнеры", "В основном, все контейнеры были закрыты. Что в них было абсолютно непонятно."},
{NoGender, "несколько столов, на которых стояла компьютерная техника", "столам", "столы", "Компьютеры были включены, но на экране мигал пароль. На одном из компьютеров был доступ в локальную сеть."},
{Male, "разобранный боевой робот", "остаткам робота", "остатки робота", "Это был разобранный робот класса А для одного бойца."},
{NoGender, "генераторы силовой установки", "генераторам", "генераторы", "На генераторе мелькала приборная панель различными огоньками индикаторов."},
{Male, "чан с кислотой", "чану", "чан", "От чана с кислотой исходил пар и небольшое зеленое сияние."},
{Male, "шкафы со всяким хламом", "шкуфу", "шкаф", "При беглом взгляде в шкафах не видно ничего ценного."},
};
DECLFULL(sceneryi);

