#include "main.h"

template<> sceneryi bsmeta<sceneryi>::elements[] = {{},
{Female, {"лестница, ведущая вниз", "лестнице", "лестницу"}},
{NoGender, {"множество контейнеров разных размеров", "контейнерам", "контейнеры"}},
{NoGender, {"несколько столов, на которых стояла компьютерная техника", "столам", "столы"}},
{Male, {"разобранный боевой робот", "остаткам робота", "остатки робота"}},
{NoGender, {"генераторы силовой установки", "генераторам", "генераторы"}},
{Male, {"чан с кислотой", "чану", "чан"}},
};
DECLFULL(sceneryi);

