#include "main.h"

BSDATA(twisti) = {{{Spring, Forest, Owl}, "¬аш отр€д пробиралс€ по лесу. ќгромные сосны скрывали в своей вышине опасных хищников, которые могли на вас напасть в любой мопент. ¬незапно, послышалс€ шум крыльев - черный хищник вас заметил и устремилс€ с высокой сосны вниз. Ёто была огромна€ сова, котора€ растопырив когти вожжелала отобедать свежей жертвой."},
{{Spring, Forest, Pathfinder}, "¬округ был весенний лес. ≈лки, сосны и другие деревь€ уходили кронами в высоту. ѕросыпались голодные хищники - они выходили на охоту. Ќа земле по€вл€лась свежа€ трава из-за нее заросли известные дороги. ѕохоже ваш отр€д заблудилс€ и идет по незнакомой местности. Ќадо срочно найти дорогу."},
};
BSDECL(twisti)