#include "main.h"

template<> featurei bsmeta<featurei>::elements[] = {{{Dungeon}, "саркофан", "Возле одной из стен находился старый пожелтевший саркофаг."},
{{Dungeon}, "алтарь", "Посредине находился полутора метровый алтарь из черного камня."},
{{Dungeon}, "бочки", "В углу стояло несколько бочек."},
{{Dungeon}, "куча мусора", "В углу находилась куча какой-то вонючей жижи, вперемешку с обломками гниющих ящиков. Стояла жуктая вонь."},
{{Dungeon}, "статуя", "Посредине стояла какая-то двухметровая статуя из потрескавшегося камня. Статуя была покрыта покрытая паутиной."},
{{Street}, "гостиница", "На перекрестке улиц находился двухэтажный дом с вывеской на которым написано \"Гостиница\"."},
};
DECLFULL(featurei);