#include "main.h"

template<> featurei bsmeta<featurei>::elements[] = {{{Dungeon}, Sarcophagus, "Возле одной из стен находился старый пожелтевший саркофаг.",
"Саркофаг был опутан паутиной. Вероятно его очень давно не открывали. %герой подумал%а что тяжелую крышку можно попробывать сдвинуть с места."},
{{Dungeon}, Altar, "Посредине находился полутора метровый алтарь из черного камня.",
"Алтарь был залит старой засохшей кровью. Судя по всему он был очень древний. На потрескавшемся камне %герой заметил%а какие-то иероглифы."},
{{Dungeon}, Barrel, "В углу стояло несколько бочек.",
"Бочки были оббиты железом и выглядели как новые."},
{{Dungeon}, Heap, "В углу находилась куча какой-то вонючей жижи, вперемешку с обломками гниющих ящиков. Стояла жуктая вонь.",
"Похоже, что куча состоит из фикалей зеленого цвета или перегноя. В ней лежало парочка сгнивших ящиков. Внезапно, %герой заметил%а как в куче что-то шевелится. Или это только показалось?"},
{{Dungeon}, Statue, "Посредине стояла какая-то двухметровая статуя из потрескавшегося камня. Статуя была покрыта покрытая паутиной.",
"Сняв часть паутины %герой обнаружил%а что статуя это человекоподобное существо с рогатой головой и крыльями за спиной."},
{{Street}, Hotel, "На перекрестке улиц находился двухэтажный дом с вывеской на которым написано \"Гостиница\"."},
};
DECLFULL(featurei);