#include "main.h"

damage_type_info damage_type_data[] = {{"Bludgeon", "Ударное", "%герой получил%а %1i урона"},
{"Slashing", "Рубящее", "%герой получил%а порез на %1i повреждений"},
{"Pierce", "Колющее", "%герой получил%а рану на %1i повреждений"},
//
{"Acid", "Кислотное", "%героя обдало кислотой"},
{"Cold", "Холодное", "%героя задуло морозным воздухом"},
{"Fire", "Огненное", "%героя обдало огнем"},
{"Force", "Силовое", "%героя ударило невидимой силой"},
{"Lightning", "Электрическое", "%героя поразило электричеством"},
{"Necrotic", "Некротическое", "%героя озарило светлозеленой вспышкой"},
{"Poison", "Ядовитое", "%героя поразило ядовитыми испарениями"},
{"Psychic", "Психическое", "У %героя парализовало разум"},
{"Radiant", "Свет", "%героя поразило ослепительным светом"},
{"Thunder", "Звуковое", "%героя сотрясло громким грохотом"},
{"Healing", "Лечебное", "%герой почувствовал облегчение"},
};
