#include "main.h"

damage_type_info damage_type_data[] = {{"Bludgeon", "Ударное", "нанес%ла удар"},
{"Slashing", "Рубящее", "рубанул%а"},
{"Pierce", "Колющее", "ткнул%а"},
//
{"Acid", "Кислотное", "обдал%а кислотой"},
{"Cold", "Холодное", "задул%а морозным воздухом"},
{"Fire", "Огненное", "обдал%а огнем"},
{"Force", "Силовое", "ударил%а невидимой силой"},
{"Lightning", "Электрическое", "поразил%а электричеством"},
{"Necrotic", "Некротическое", "задул%а морозным воздухом"},
{"Poison", "Ядовитое", "поразил%а ядовитыми испарениями"},
{"Psychic", "Психическое", "парализовал%а разум"},
{"Radiant", "Свет", "поразил%а ослепительным светом"},
{"Thunder", "Звуковое", "сотрясл%а громким грохотом"},
};
