#include "main.h"

enum word_s { Masculine, Femine, Neuter, Pluar };

static struct terrain_i {
	const char*		name[2];
	word_s			word;
} terrains[] = {
	{{"Bay", "Бухта"}, Femine},
{{"Bluffs", "Обрывы"}, Pluar},
{{"Bog", "Топь"}, Femine},
{{"Cliffs", "Скалы"}, Pluar},
{{"Desert", "Пустыня"}, Femine},
{{"Downs", "Склоны"}, Pluar},
{{"Dunes", "Дюны"}, Pluar},
{{"Expanse", "Раздолье"}, Neuter},
{{"Fells", "Вырубка"}, Femine},
{{"Fen", "Трясина"}, Femine},
{{"Flats", "Низины"}, Pluar},
{{"Foothills", "Подножье гор"}, Neuter},
{{"Forest", "Лес"}, Masculine},
{{"Groves", "Роща"}, Femine},
{{"Heath", "Поле"}, Neuter},
{{"Heights", "Высоты"}, Pluar},
{{"Hills", "Холмы"}, Pluar},
{{"Hollows", "Лощина"}, Femine},
{{"Jungle", "Джунгли"}, Pluar},
{{"Lake", "Озеро"}, Neuter},
{{"Lowland", "Низина"}, Femine},
{{"March", "Топи"}, Neuter},
{{"Meadows", "Луга"}, Pluar},
{{"Moor", "Торфяники"}, Pluar},
{{"Morass", "Плавни"}, Pluar},
{{"Mounds", "Курганы"}, Pluar},
{{"Mountains", "Горы"}, Pluar},
{{"Peaks", "Утесы"}, Pluar},
{{"Plains", "Равнины"}, Pluar},
{{"Prairie", "Прерия"}, Femine},
{{"Quagmire", "Заводь"}, Femine},
{{"Range", "Кряж"}, Masculine},
{{"Reach", "Горизонт"}, Masculine},
{{"Sands", "Пески"}, Pluar},
{{"Savanna", "Саванна"}},
{{"Scarps", "Откосы"}, Pluar},
{{"Sea", "Море"}, Neuter},
{{"Slough", "Болота"}, Pluar},
{{"Sound", "Пролив"}, Masculine},
{{"Steppe", "Степь"}, Femine},
{{"Swamp", "Болото"}, Neuter},
{{"Sweep", "Извилина"}, Femine},
{{"Teeth", "Зубы"}, Pluar},
{{"Thicket", "Чащоба"}, Femine},
{{"Upland", "Нагорье"}, Neuter},
{{"Wall", "Стена"}, Femine},
{{"Waste", "Запустение"}, Neuter},
{{"Wasteland", "Пустошь"}, Femine},
{{"Woods", "Леса"}, Pluar},
};
static const char* adjectives[][6] = {
	{"Ageless", "Вечности", "Вечный", "Вечная", "Вечное", "Вечные"},
{"Ashen", "Пыли", "Пыльный", "Пыльная", "Пыльное", "Пыльные"},
{"Black", "Черноты", "Черный", "Черная", "Черное", "Черные"},
{"Blessed", "Благословения", "Благословенный", "Благословенная", "Благословенное", "Благословенные"},
{"Blighted", "Мрака", "Мрачный", "Мрачная", "Мрачное", "Мрачные"},
{"Blue", "Синевы", "Синий", "Синяя", "Синее", "Синие"},
{"Broken", "Ломания", "Сломаный", "Сломаная", "Сломаное", "Сломаные"},
{"Burning", "Горения", "Горящий", "Горящая", "Горящее", "Горящие"},
{"Copper", "Меди", "Медный", "Медная", "Медное", "Медные"},
{"Cursed", "Проклятия", "Проклятый", "Проклятая", "Проклятое", "Проклятые"},
{"Dark", "Темноты", "Темный", "Темная", "Темное", "Темные"},
{"Dead", "Мертвых", "Мертвый", "Мертвая", "Мертвое", "Мертвые"},
{"Deep", "Глубины", "Глубокий", "Глубокая", "Глубокое", "Глубокие"},
{"Demon’s", "Демона", "Демонический", "Демоническая", "Демоническое", "Демонические"},
{"Desolate", "Безлюдья", "Безлюдный", "Безлюдная", "Безлюдное", "Безлюдные"},
{"Devil’s", "Дьявола", "Дъяольский", "Дъяольская", "Дъяольское", "Дъяольские"},
{"Diamond", "Бриллианта", "Бриллиантный", "Бриллиантная", "Бриллиантное", "Бриллиантные"},
{"Dismal", "Угнетения", "Угнетающий", "Угнетающая", "Угнетающее", "Угнетающие"},
{"Dun", "Сумрака", "Сумрачный", "Сумрачная", "Сумрачное", "Сумрачные"},
{"Emerald", "Изумруда", "Изумрудный", "Изумрудная", "Изумрудное", "Изумрудные"},
{"Endless", "Бесконечности", "Бесконечный", "Бесконечная", "Бесконечное", "Бесконечные"},
{"Fallen", "Падших", "Падший", "Падшая", "Падшее", "Падшие"},
{"Far", "Горизонта", "Далекий", "Далекая", "Далекое", "Далекие"},
{"Fell", "Жестокости", "Жестокий", "Жестокая", "Жестокое", "Жестокие"},
{"Fire", "Огня", "Огненный", "Огненная", "Огненное", "Огненные"},
{"Forgotten", "Забытья", "Забытый", "Забытая", "Забытое", "Забытые"},
{"Forsaken", "Забытья", "Заброшенный", "Заброшенная", "Заброшенное", "Заброшенные"},
{"Frozen", "Мерзлоты", "Замерзший", "Замерзшая", "Замерзшее", "Замерзшие"},
{"Ghost", "Пизраков", "Призрачный", "Призрачная", "Призрачное", "Призрачные"},
{"Golden", "Золота", "Золотой", "Золотая", "Золотое", "Золотые"},
{"Green", "Зелени", "Зеленый", "Зеленая", "Зеленое", "Зеленые"},
{"Holy", "Святости", "Священный", "Священная", "Священное", "Священные"},
{"Iron", "Железа", "Железный", "Железная", "Железное", "Железные"},
{"Jagged", "Зубов", "Зубастый", "Зубастая", "Зубастое", "Зубастые"},
{"King’s", "Короля", "Королевский", "Королевская", "Королевское", "Королевские"},
{"Light", "Света", "Светлый", "Светлая", "Светлое", "Светлые"},
{"Perilous", "Опасности", "Опасные", "Опасная", "Опасное", "Опасные"},
{"Queen’s", "Королевы", "Королевский", "Королевская", "Королевское", "Королевские"},
{"Red", "Красноты", "Красные", "Красная", "Красное", "Красные"},
{"Ruby", "Рубина", "Рубиновый", "Рубиновая", "Рубиновое", "Рубиновые"},
{"Sapphire", "Сапфира", "Сапфировый", "Сапфировая", "Сапфировое", "Сапфировые"},
{"Shadow", "Пересвета", "Тусклый", "Тусклая", "Тусклое", "Тусклые"},
{"Shattered", "Осколков", "Разбитый", "Разбитая", "Разбитое", "Разбитые"},
{"Shifting", "Движения", "Движущийся", "Движущаяся", "Движущееся", "Движущиеся"},
{"Silver", "Серебра", "Серебрянный", "Серебрянная", "Серебрянное", "Серебрянные"},
{"Umber", "Умбры", "Коричневый", "Коричневая", "Коричневое", "Коричневые"},
{"White", "Белого", "Белый", "Белая", "Белое", "Белые"},
{"Wicked", "Нечисти", "Нечистый", "Нечистая", "Нечистое", "Нечистые"},
{"Yellow", "Желтизны", "Желтый", "Желтая", "Желтое", "Желтые"},
};
static const char* nouns[][6] = {
	{"", ""},
{"Ash", "Пепла", "Пепельный", "Пепельная", "Пепельное", "Пепельные"},
{"Bone", "Костей", "Костяной", "Костяная", "Костяное", "Костяные"},
{"Darkness", "Тьмы", "Темный", "Темная", "Темное", "Темные"},
{"Dead", "Мертвых", "Мертвый", "Мертвая", "Мертвое", "Мертвые"},
{"Death", "Смерти", "Смертельный", "Смертельная", "Смертельное", "Смертельные"},
{"Desolation", "Опустошения", "Заброшенный", "Заброшенная", "Заброшенное", "Заброшенные"},
{"Despair", "Отчаяния", "Отчаяный", "Отчаянная", "Отчаяное", "Отчаянные"},
{"Devil", "Дьявола", "Дьявольский", "Дьявольская", "Дьявольское", "Дьявольские"},
{"Doom", "Рока", "Роковой", "Роковая", "Роковое", "Роковые"},
{"Dragon", "Дракона", "Драконий", "Драконья", "Драконье", "Драконьи"},
{"Fate", "Судьбы", "Судьбоносный", "Судьбоносная", "Судьбоносное", "Судьбоносные"},
{"Fear", "Страха", "Страшный", "Страшная", "Страшное", "Страшные"},
{"Fire", "Огня", "Огненный", "Огненная", "Огненное", "Огненные"},
{"Fury", "Ярости", "Яростный", "Яростная", "Яростное", "Яростные"},
{"Ghost", "Призраков", "Призрачный", "Призрачная", "Призрачное", "Призрачные"},
{"Giant", "Гигантов", "Гиганский", "Гиганская", "Гиганское", "Гиганские"},
{"God", "Бога", "Божественный", "Божественная", "Божественное", "Божественные"},
{"Gold", "Золота", "Золотой", "Золотая", "Золотое", "Золотые"},
{"Heaven", "Рая", "Райский", "Райская", "Райское", "Райские"},
{"Hell", "Ада", "Адский", "Адская", "Адское", "Адские"},
{"Hero", "Героев", "Героический", "Героическая", "Героическое", "Героические"},
{"Honor", "Славы", "Славный", "Славная", "Славное", "Славные"},
{"Hope", "Надежды", "Внушающий надежду", "Внушающая надежду", "Внушающее надежду", "Внушающие надежду"},
{"Horror", "Ужаса", "Ужасный", "Ужасная", "Ужасное", "Ужасные"},
{"King", "Короля", "Королевский", "Короевская", "Королевское", "Королевские"},
{"Life", "Жизни", "Дарующий жизнь", "Дарующая жизнь", "Дарующее жизнь", "Дарующие жизнь"},
{"Light", "Света", "Светлый", "Светлая", "Светлое", "Светлые"},
{"Lost", "Затерянных", "Затерянный", "Затерянная", "Затерянное", "Затерянные"},
{"Mist", "Тумана", "Туманный", "Туманная", "Туманное", "Туманные"},
{"Pity", "Жалости", "Жалостливый", "Жалостливая", "Жалостливое", "Жалостливые"},
{"Queen", "Королевы", "Королевский", "Королевская", "Королевское", "Королевские"},
{"Rain", "Дождя", "Вечнодождивый", "Вечнодождливая", "Вечнодождливое", "Вечнодождливые"},
{"Refuge", "Утешения", "Утешенный", "Утешенная", "Утешенное", "Утешенные"},
{"Regret", "Раскаяния", "Раскаянный", "Раскаянная", "Раскаянное", "Раскаянные"},
{"Savior", "Спасителя", "Породивший спасителя", "Породившая спасителя", "Породившее спасителя", "Породившие спасителя"},
{"Shadow", "Теней", "Теневой", "Теневая", "Теневое", "Теневые"},
{"Silver", "Серебра", "Серебрянный", "Серебрянная", "Серебрянное", "Серебрянные"},
{"Skull", "Черепа", "Черепной", "Черепная", "Черепное", "Черепные"},
{"Sky", "Неба", "Небесный", "Небесная", "Небесное", "Небесные"},
{"Smoke", "Дыма", "Дымный", "Дымная", "Дымное", "Дымные"},
{"Snake", "Змей", "Змеиный", "Змеинная", "Змеинное", "Змеинные"},
{"Sorrow", "Печали", "Печальный", "Печальная", "Печальное", "Печальные"},
{"Storm", "Бурь", "Штормовой", "Штормовая", "Штормовое", "Штормовые"},
{"Sun", "Солнца", "Солнечный", "Солнечная", "Солнечное", "Солнечные"},
{"Thorn", "Колючек", "Колючий", "Колючая", "Колючее", "Колючие"},
{"Thunder", "Грома", "Громовой", "Громовая", "Громовое", "Громовые"},
{"Traitor", "Предателя", "Предательский", "Предательская", "Предательское", "Предательские"},
{"Troll", "Тролей", "Населенный троллями", "Населенная троллями", "Населенное троллями", "Населенные троллями"},
{"Witch", "Ведьмы", "Ведьминский", "Ведьминская", "Ведьмино", "Ведьмины"},
};

void steading::setrandomname() {
	unsigned char tmp;
	auto d = rand() % 12;
	if(d < 4)
		tmp = 6;
	else if(d < 6)
		tmp = 1;
	else if(d < 8)
		tmp = 2;
	else if(d < 10)
		tmp = 3;
	else if(d < 11)
		tmp = 4;
	else
		tmp = 5;
	auto terrain = rand() % 50;
	auto adjective = rand() % 50;
	auto noun = rand() % 50;
	//
	names[0] = tmp;
	names[1] = terrain;
	names[2] = adjective;
	names[3] = noun;
}

char* steading::getname(char* temp, const char* result_maximum) const {
	auto tmp = names[0];
	auto terrain = names[1];
	auto adjective = names[2];
	auto noun = names[3];
	//
	auto pa = adjectives[adjective][terrains[terrain].word + 2];
	auto pn = nouns[noun][1];
	auto pt = terrains[terrain].name[1];
	switch(tmp) {
	case 1:
		szprints(temp, result_maximum, "%1 %3", pt, pa, pn);
		break;
	case 2:
		pa = adjectives[adjective][1];
		szprints(temp, result_maximum, "%1 %2", pt, pa, pn);
		break;
	case 3:
		pn = nouns[noun][terrains[terrain].word + 2];
		szprints(temp, result_maximum, "%3 %2 %1", pt, pa, pn);
		break;
	case 4:
		szprints(temp, result_maximum, "%2 %1 %3", pt, pa, pn);
		break;
	default:
		szprints(temp, result_maximum, "%2 %1", pt, pa, pn);
		break;
	}
	return temp;
}